Конфигурация/InformationRegisters/ЖурналСверкиСоСписками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЖурналСверкиСоСписками</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пройдена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейСверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеквизитыСверки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПеречнейОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ЖурналСверкиСоСписками/Forms/ФормаОтчетаПоРезультатамСверки/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	
	ЭтаФорма.Результат = 
		СформироватьНаСервере(ЭтаФорма.Организация, 
	                          ЭтаФорма.ВидПеречня, 
	                          ЭтаФорма.Период,
							  Элементы.ВидПеречня.ТекстРедактирования, 
                              ЭтаФорма.СверятьЗакрытыеСчетаИСвязанныеЛица);
							  
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере(Организация, ВидПеречня, Период, ЗаголовокОтчета, СверятьЗакрытыеСчетаИСвязанныеЛица)
	
	Если ВидПеречня = Справочники.ВидыПеречнейОбъектов.СписокНедействительныхПаспортов Тогда
		ДокументРезультат = РегистрыСведений.ЖурналСверкиСоСписками.РезультатыСверкиСоСпискомНедействительныхПаспортов(Организация, ВидПеречня, Период);
		
	ИначеЕсли ВидПеречня = Справочники.ВидыПеречнейОбъектов.СМЭВ Тогда
		ДокументРезультат = РегистрыСведений.ЖурналСверкиСоСписками.РезультатыСверкиПоСМЭВНедействительныеПаспорта(Организация, Период);
		
	ИначеЕсли ВидПеречня = Справочники.ВидыПеречнейОбъектов.СписокДисквалифицированныхЛиц Тогда
		ДокументРезультат = РегистрыСведений.ЖурналСверкиСоСписками.РезультатыСверкиСоСпискомДисквалифицированныхЛиц(Организация, ВидПеречня, Период);
		
	Иначе
		СхемаКомпоновкиДанных = РегистрыСведений.ЖурналСверкиСоСписками.ПолучитьМакет("РезультатыСверки");
		
		НастройкиКомпоновки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
		НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", Организация);
		НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидПеречня", ВидПеречня);
		НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", КонецДня(Период));
		НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("СверятьЗакрытыеСчетаИСвязанныеЛица", СверятьЗакрытыеСчетаИСвязанныеЛица);
		НастройкиКомпоновки.ПараметрыДанных.УстановитьЗначениеПараметра("ИсключитьНоминальныхДержателейПаев", ИсключитьНоминальныхДержателейПаев);
		
		Если ЗначениеЗаполнено(ЗаголовокОтчета) Тогда
			НастройкиКомпоновки.ПараметрыВывода.УстановитьЗначениеПараметра("Заголовок", ЗаголовокОтчета);
		КонецЕсли;

		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновки);
		
		ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , , Истина);
		
		ДокументРезультат = Новый ТабличныйДокумент;
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
		ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
		ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	КонецЕсли;
	
	ДокументРезультат.ТолькоПросмотр		= Истина;
	ДокументРезультат.ОтображатьСетку		= Ложь;
	ДокументРезультат.ОтображатьЗаголовки	= Ложь;
	
	// Заполняем настройки печати по умочанию
	КлючПараметровПечати = "КлиентыСверенныеСоСписком" + РегистрыСведений.ЖурналСверкиСоСписками.ИмяКлючаПараметровПечати(ВидПеречня);
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, КлючПараметровПечати, Истина, ОриентацияСтраницы.Портрет);
	
	Возврат ДокументРезультат;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Элементы.ВидПеречня.СписокВыбора.Добавить(Справочники.ВидыПеречнейОбъектов.СанкционныйСписок, 				"Клиенты, сверенные со списком лиц, в отношении которых вводятся специальные экономические меры");
	Элементы.ВидПеречня.СписокВыбора.Добавить(Справочники.ВидыПеречнейОбъектов.СписокЛицСЗамороженнымиСчетами, 	"Клиенты, сверенные со списком лиц с замороженными счетами");
	Элементы.ВидПеречня.СписокВыбора.Добавить(Справочники.ВидыПеречнейОбъектов.СписокОтказников, 				"Клиенты, сверенные со списком лиц, которым отказано в операции с ДС, открытии или закрытии депозитного вклада");
	Элементы.ВидПеречня.СписокВыбора.Добавить(Справочники.ВидыПеречнейОбъектов.СписокРешенийМВК, 				"Клиенты, сверенные со списком решений МВК");
	Элементы.ВидПеречня.СписокВыбора.Добавить(Справочники.ВидыПеречнейОбъектов.СписокТеррористов, 				"Клиенты, сверенные со списком террористов");
	Элементы.ВидПеречня.СписокВыбора.Добавить(Справочники.ВидыПеречнейОбъектов.СписокФРОМУ, 					"Клиенты, сверенные со списком субъектов, причастных к распространению ОМУ");
	Элементы.ВидПеречня.СписокВыбора.Добавить(Справочники.ВидыПеречнейОбъектов.СписокНедействительныхПаспортов, "Клиенты, сверенные со списком недействительных паспортов");
	Элементы.ВидПеречня.СписокВыбора.Добавить(Справочники.ВидыПеречнейОбъектов.СМЭВ, "Клиенты с недействительными паспортами");
	Элементы.ВидПеречня.СписокВыбора.Добавить(Справочники.ВидыПеречнейОбъектов.СписокДисквалифицированныхЛиц,	"Должностные лица, сверенные со списком дисквалифицированных лиц");
	Элементы.ВидПеречня.СписокВыбора.Добавить(Справочники.ВидыПеречнейОбъектов.СводныйПереченьСоветаБезопасностиООН, "Клиенты, сверенные со сводным перечнем Совета Безопасности ООН");
	Элементы.ВидПеречня.СписокВыбора.Добавить(Справочники.ВидыПеречнейОбъектов.СанкционныйСписокНедружественныхГосударств, "Клиенты, сверенные с санкционным списком недружественных государств");
	
	Параметры.Свойство("ВидПеречня", ЭтаФорма.ВидПеречня);
	Параметры.Свойство("Период", ЭтаФорма.Период);
	
	Если Параметры.Свойство("СформироватьОтчет") И ЗначениеЗаполнено(ЭтаФорма.ВидПеречня) Тогда
		
		ЗаголовокОтчета = Элементы.ВидПеречня.СписокВыбора.НайтиПоЗначению(ЭтаФорма.ВидПеречня).Представление;
		ЭтаФорма.Результат = СформироватьНаСервере(ЭтаФорма.Организация, ЭтаФорма.ВидПеречня, ЭтаФорма.Период, ЗаголовокОтчета, ЭтаФорма.СверятьЗакрытыеСчетаИСвязанныеЛица);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПеречняПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидимостьИДоступность() 
	
	Этаформа.Элементы.ГруппаДопНастройки.Видимость = 
		ЗначениеЗаполнено(ЭтаФорма.ВидПеречня)	
		И Не (ЭтаФорма.ВидПеречня = ПредопределенноеЗначение("Справочник.ВидыПеречнейОбъектов.СписокНедействительныхПаспортов")
				Или ЭтаФорма.ВидПеречня = ПредопределенноеЗначение("Справочник.ВидыПеречнейОбъектов.СМЭВ")
				Или ЭтаФорма.ВидПеречня = ПредопределенноеЗначение("Справочник.ВидыПеречнейОбъектов.СписокДисквалифицированныхЛиц"));
				
	РаботаСФормамиКлиентСервер.ОчиститьЗначенияСкрытыхПолей(ЭтаФорма, Новый Структура("ГруппаДопНастройки", "СверятьЗакрытыеСчетаИСвязанныеЛица")); 			

КонецПроцедуры
